projects/common/src/main/resources/wsdl/Mirth.wsdl

<?xml version="1.0" encoding="UTF-8"?>
	<!--
		Published by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is
		JAX-WS RI 2.1.6 in JDK 6.
	-->
	<!--
		Generated by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is
		JAX-WS RI 2.1.6 in JDK 6.
	-->
<definitions xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
	xmlns:tns="http://ws.connectors.connect.mirth.com/" xmlns:xsd="http://www.w3.org/2001/XMLSchema"
	xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://ws.connectors.connect.mirth.com/"
	name="DefaultAcceptMessageService">
	<types>
		<xsd:schema>
			<xsd:import namespace="http://ws.connectors.connect.mirth.com/"
				schemaLocation="../schema/Mirth.xsd"></xsd:import>
		</xsd:schema>
	</types>
	<message name="acceptMessage">
		<part name="parameters" element="tns:acceptMessage"></part>
	</message>
	<message name="acceptMessageResponse">
		<part name="parameters" element="tns:acceptMessageResponse"></part>
	</message>
	<portType name="DefaultAcceptMessage">
		<operation name="acceptMessage">
			<input message="tns:acceptMessage"></input>
			<output message="tns:acceptMessageResponse"></output>
		</operation>
	</portType>
	<binding name="DefaultAcceptMessagePortBinding" type="tns:DefaultAcceptMessage">
		<soap:binding transport="http://schemas.xmlsoap.org/soap/http"
			style="document"></soap:binding>
		<operation name="acceptMessage">
			<soap:operation soapAction=""></soap:operation>
			<input>
				<soap:body use="literal"></soap:body>
			</input>
			<output>
				<soap:body use="literal"></soap:body>
			</output>
		</operation>
	</binding>
	<service name="DefaultAcceptMessageService">
		<port name="DefaultAcceptMessagePort" binding="tns:DefaultAcceptMessagePortBinding">
			<soap:address location="http://localhost:12085/services/Mirth"></soap:address>
		</port>
	</service>
</definitions>