mirth-soap-request-dhc.json

{"version":3, "nodes":[{"id":"29F5FC47-6594-4DB3-BEFC-4F49C2BFC47E", "lastModified":"2015-05-04T14:17:47.393-02:00", "name":"CASMU", "type":"Project"},{"id":"2780119E-524F-45E5-9648-BAFD754C4A69", "lastModified":"2015-05-04T14:17:47.397-02:00", "name":"Mirth SOAP Request", "type":"Service", "parentId":"29F5FC47-6594-4DB3-BEFC-4F49C2BFC47E"},{"id":"74806742-5177-4A77-BA14-FE731F6255FE", "lastModified":"2015-05-04T14:17:47.397-02:00", "name":"mirth soap &#10; es CR", "headers":[{"enabled":true, "name":"Content-Type", "value":"text/xml"},{"enabled":true, "name":"SOAP-Action", "value":"http://localhost:8086/services/Mirth/acceptMessage"}], "method":{"requestBody":true, "link":"http://tools.ietf.org/html/rfc7231#section-4.3.3", "name":"POST"}, "body":{"autoSetLength":true, "textBody":"<SOAP-ENV:Envelope\n         xmlns:SOAP-ENV=\"http://schemas.xmlsoap.org/soap/envelope/\"\n         SOAP-ENV:encodingStyle=\"http://schemas.xmlsoap.org/soap/encoding/\">\n   <SOAP-ENV:Body>\n      <m:acceptMessage xmlns:m=\"http://ws.connectors.connect.mirth.com/\">\n        <arg0>MSH|^~\\&amp;|ZIS|1^AHospital|ASD|FDGDG|199605141144||ADT^A01|20031104082400|P|2.3|||AL|NE|&#10;EVN|A01|20031104082400.0000+0100|20031104082400&#10;PID|||10||Vries^Danny^D.e||19951202|M|||Rembrandlaan^7^Leiden^^7301TH^^^P|&#10;</arg0>\n      </m:acceptMessage>\n   </SOAP-ENV:Body>\n</SOAP-ENV:Envelope>", "bodyType":"Text"}, "headersType":"Raw", "type":"Request", "uri":{"path":"localhost:8086/services/Mirth/acceptMessage", "scheme":{"name":"http", "version":"V11"}}, "parentId":"2780119E-524F-45E5-9648-BAFD754C4A69"}]}